[
  {
    "id": "ruling-on-friday-prayer",
    "title": "Ruling on Friday Prayer",
    "titleAr": "حكم صلاة الجمعة",
    "category": "Fiqh",
    "categoryAr": "فقه",
    "date": "2026-01-28",
    "excerpt": "What is the ruling on Friday prayer and its conditions?",
    "excerptAr": "ما حكم صلاة الجمعة وشروطها؟",
    "content": "Friday prayer is obligatory upon every adult, sane, resident Muslim male who is not excused. It is one of the most important obligations and a great congregation that Allah has legislated for this Ummah.\n\nThe evidence for its obligation includes the saying of Allah: 'O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew.' [Al-Jumu'ah: 9]\n\nConditions for its validity include: the time entering (after zawaal/noon), the presence of the required number of people according to the majority of scholars, and the performance of two khutbahs before the prayer.",
    "contentAr": "صلاة الجمعة واجبة على كل مسلم بالغ عاقل مقيم ذكر غير معذور، وهي من أعظم الواجبات وأجل الاجتماعات التي شرعها الله لهذه الأمة.\n\nوالدليل على وجوبها قول الله تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِن يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ} [الجمعة: 9].\n\nومن شروط صحتها: دخول الوقت (بعد الزوال)، وحضور العدد المطلوب عند جمهور العلماء، وإقامة خطبتين قبل الصلاة.\n\nويجب على المسلم أن يحرص على أداء صلاة الجمعة في المسجد مع الجماعة، وأن يستعد لها بالغسل والتطيب ولبس أحسن الثياب."
  },
  {
    "id": "zakat-on-gold",
    "title": "Zakat on Gold Jewelry",
    "titleAr": "زكاة الذهب والحلي",
    "category": "Fiqh",
    "categoryAr": "فقه",
    "date": "2026-01-25",
    "excerpt": "Is zakat obligatory on gold jewelry worn by women?",
    "excerptAr": "هل تجب الزكاة في الذهب الذي تلبسه المرأة؟",
    "content": "The scholars have differed regarding zakat on gold jewelry that is prepared for permissible use by women. The correct opinion is that zakat is obligatory on it if it reaches the nisab (threshold), based on the general evidences regarding the obligation of zakat on gold and silver.\n\nThe nisab for gold is 85 grams, and the amount due is 2.5% of its value, to be paid annually. This should be calculated based on the current market value of gold.\n\nHowever, if the jewelry is being worn and used regularly for adornment, and not kept as a store of wealth, some scholars hold that no zakat is due on it. The more cautious opinion is to pay zakat to fulfill one's duty with certainty.",
    "contentAr": "اختلف العلماء في حكم زكاة الحلي من الذهب المعد للاستعمال المباح للمرأة، والراجح وجوب الزكاة فيه إذا بلغ النصاب، لعموم الأدلة في وجوب الزكاة في الذهب والفضة.\n\nونصاب الذهب خمسة وثمانون جراماً، والواجب فيه ربع العشر (2.5%)، يخرج من قيمته كل عام. ويحسب النصاب بالقيمة الحالية للذهب في السوق.\n\nوإذا كانت الحلي تُلبس وتُستعمل في الزينة المعتادة، ولم تُتخذ للادخار والكنز، فقد ذهب بعض العلماء إلى عدم وجوب الزكاة فيها. والأحوط إخراج الزكاة خروجاً من الخلاف وبراءةً للذمة."
  },
  {
    "id": "tayammum-conditions",
    "title": "Conditions of Tayammum",
    "titleAr": "شروط التيمم",
    "category": "Fiqh",
    "categoryAr": "فقه",
    "date": "2026-01-20",
    "excerpt": "What are the conditions and method of performing tayammum (dry ablution)?",
    "excerptAr": "ما هي شروط التيمم وكيفية أدائه؟",
    "content": "Tayammum is a concession that Allah has granted to this Ummah as an alternative to wudu or ghusl when water is unavailable or its use would cause harm.\n\nConditions for tayammum:\n1. Absence of water or inability to use it due to illness or fear of harm\n2. The time for prayer has entered\n3. Using pure earth or dust\n\nMethod of tayammum:\n1. Make the intention\n2. Say Bismillah\n3. Strike the earth once with both hands\n4. Wipe the entire face\n5. Wipe both hands up to the wrists\n\nTayammum is valid for one prayer only and is nullified by the same things that nullify wudu, as well as by the availability of water.",
    "contentAr": "التيمم رخصة من الله تعالى لهذه الأمة، وهو بدل عن الوضوء أو الغسل عند عدم وجود الماء أو تعذر استعماله.\n\nشروط التيمم:\n1. عدم وجود الماء أو العجز عن استعماله لمرض أو خوف من الضرر\n2. دخول وقت الصلاة\n3. استخدام تراب طاهر\n\nكيفية التيمم:\n1. النية\n2. التسمية\n3. ضرب الأرض بباطن الكفين ضربة واحدة\n4. مسح الوجه كله\n5. مسح اليدين إلى الرسغين\n\nوالتيمم لا يرفع الحدث بل يبيح الصلاة، وينقضه ما ينقض الوضوء، ووجود الماء مع القدرة على استعماله."
  },
  {
    "id": "fasting-makeup-days",
    "title": "Making Up Missed Fasting Days",
    "titleAr": "قضاء أيام رمضان الفائتة",
    "category": "Fiqh",
    "categoryAr": "فقه",
    "date": "2026-01-15",
    "excerpt": "When must missed Ramadan fasts be made up, and what if someone delays?",
    "excerptAr": "متى يجب قضاء أيام رمضان الفائتة، وماذا لو تأخر الشخص في القضاء؟",
    "content": "Whoever has missed days of Ramadan due to a valid excuse (such as illness, travel, menstruation, or post-natal bleeding) must make them up before the next Ramadan begins.\n\nThe time for making up these days extends from the day after Eid al-Fitr until the beginning of the next Ramadan. It is not necessary to make them up consecutively; they may be done on separate days.\n\nIf someone delays making up the days without a valid excuse until the next Ramadan begins, they must:\n1. Make up the missed days after the second Ramadan\n2. Feed one poor person for each day delayed (according to the majority of scholars)\n\nIf the delay was due to a valid excuse, then only the makeup is required without the expiation of feeding the poor.",
    "contentAr": "من أفطر في رمضان بعذر شرعي (كالمرض والسفر والحيض والنفاس) وجب عليه قضاء الأيام التي أفطرها قبل دخول رمضان القادم.\n\nووقت القضاء موسع من ثاني يوم العيد إلى ما قبل رمضان القادم، ولا يشترط التتابع في القضاء، بل يجوز قضاؤها متفرقة.\n\nومن أخر القضاء بلا عذر حتى دخل رمضان آخر، فعليه:\n1. القضاء بعد رمضان الثاني\n2. الكفارة بإطعام مسكين عن كل يوم عند جمهور العلماء\n\nأما إن كان التأخير لعذر، فليس عليه إلا القضاء فقط دون الكفارة.\n\nوالله أعلم."
  },
  {
    "id": "names-of-allah",
    "title": "Understanding the Names of Allah",
    "titleAr": "فهم أسماء الله الحسنى",
    "category": "Aqeedah",
    "categoryAr": "عقيدة",
    "date": "2026-01-10",
    "excerpt": "How should Muslims understand and apply the beautiful names of Allah?",
    "excerptAr": "كيف ينبغي للمسلم فهم أسماء الله الحسنى والتعبد بها؟",
    "content": "The Names of Allah are among the greatest aspects of knowledge about Allah. Learning them, understanding their meanings, and calling upon Allah by them is an act of worship.\n\nPrinciples in understanding Allah's Names:\n1. They indicate perfection without any deficiency\n2. Each name has a specific meaning that must be affirmed for Allah\n3. They are tawqifiyyah (limited to what has been revealed in the Quran and authentic Sunnah)\n4. We must affirm what they indicate of Allah's attributes\n\nWays to worship Allah through His Names:\n1. Memorizing them and understanding their meanings\n2. Calling upon Allah using them\n3. Praising and glorifying Allah with them\n4. Adopting the suitable manners that each name requires\n\nAllah says: 'And to Allah belong the best names, so invoke Him by them.' [Al-A'raf: 180]",
    "contentAr": "أسماء الله الحسنى من أعظم أبواب العلم بالله، والتعلم لها وفهم معانيها والدعاء بها عبادة عظيمة.\n\nقواعد في فهم أسماء الله:\n1. أنها دالة على الكمال المطلق من غير نقص\n2. كل اسم له معنى خاص يجب إثباته لله\n3. أنها توقيفية (لا يُسمى الله إلا بما سمى به نفسه في القرآن والسنة الصحيحة)\n4. يجب إثبات ما دلت عليه من صفات الله\n\nطرق التعبد لله بأسمائه:\n1. حفظها وفهم معانيها\n2. دعاء الله بها\n3. الثناء على الله بها\n4. التخلق بما يناسب منها\n\nقال الله تعالى: {وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا} [الأعراف: 180].\n\nوالله أعلم."
  },
  {
    "id": "seeking-knowledge",
    "title": "The Importance of Seeking Islamic Knowledge",
    "titleAr": "أهمية طلب العلم الشرعي",
    "category": "Other",
    "categoryAr": "أخرى",
    "date": "2026-01-05",
    "excerpt": "Why is seeking Islamic knowledge obligatory and how should one approach it?",
    "excerptAr": "لماذا يجب طلب العلم الشرعي وكيف ينبغي للمسلم أن يطلبه؟",
    "content": "Seeking Islamic knowledge is one of the most important obligations upon Muslims. It is the path to knowing Allah, understanding His commands, and worshipping Him correctly.\n\nThe Prophet ﷺ said: 'Seeking knowledge is obligatory upon every Muslim.' [Ibn Majah]\n\nTypes of obligatory knowledge:\n1. Knowledge of belief and creed\n2. Knowledge of acts of worship one is required to perform\n3. Knowledge of prohibited matters to avoid them\n4. Knowledge related to one's profession or circumstances\n\nEtiquette of seeking knowledge:\n1. Sincerity of intention for Allah's sake\n2. Acting upon what one learns\n3. Being patient and persistent\n4. Respecting scholars and teachers\n5. Beginning with the most important matters\n6. Gradual progression in learning\n\nKnowledge is light that Allah places in the heart of the believer, guiding them to righteousness.",
    "contentAr": "طلب العلم الشرعي من أعظم الواجبات على المسلمين، فهو الطريق إلى معرفة الله ومعرفة أحكامه وعبادته على بصيرة.\n\nقال النبي ﷺ: «طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ» [رواه ابن ماجه].\n\nأقسام العلم الواجب:\n1. علم العقيدة والتوحيد\n2. علم العبادات التي يقوم بها المسلم\n3. علم المحرمات ليجتنبها\n4. علم المعاملات التي يحتاجها في حياته\n\nآداب طالب العلم:\n1. إخلاص النية لله تعالى\n2. العمل بما يتعلم\n3. الصبر والمثابرة\n4. احترام العلماء والمشايخ\n5. البدء بالأهم فالأهم\n6. التدرج في التعلم\n\nوالعلم نور يقذفه الله في قلب العبد، يهديه إلى الصراط المستقيم.\n\nوالله أعلم."
  }
]
